import { Helmet } from "react-helmet";
import { Wrapper, H1, P } from "../pagesStyles";
import Wellcome from '../Home/WellcomeText/WellcomeDiv';
const Periodpress = () => {
    return (
        <>
            <Helmet>
                <title>Periodpress</title>
                <meta name="description" content="Nested component" />
            </Helmet>
            <Wellcome />
            <Wrapper>
                <H1>БІЛЬШ ДЕТАЛЬНО ПРО РОБОТУ НАД САЙТОМ "PERIODPRESS.ONU.EDU.UA"</H1>
                <P>В далекому вже, 2018, коли курс ATO-IT підходив до своєї завершальної стадії, кожному з учасників було надане завдання з створення першого сайту. Кожен з нас повинен був знайти клієнта, якому потрібен простий сайт, або, була можливість, написати сайт просто для себе. Я, в свою чергу, вирішив не шукати легких шляхів і взявся за втілення в життя, на той момент, для мене, дуже складного проєкту, на достатньо велику кількість сторінок.</P>

                <P>Насправді, сайт дуже простий, в ньому немає ні зворотнього зв'язку, ні складного JS скріпту. Його дизайн родом з початку 2000-х. Проте, як першим моїм проєктом, я дуже був ним задоволений.</P>

                <P>В один прекрасний день я зрозумів, що сайту потрібен апгрейд, бо кожен раз лазити в код, щоб змінити будь-який текст, було тією ще морокою. Тому, вмотивувашись на результат і знайшовши розробку адміністративної панелі, я вирішив створити щось, що хоч віддалено нагадувало б адміністративну панель та вирішувало б елементарні питання, будь то зміна тексту або картинки.</P>

                <P>Зразок, знайденої мною адмін панелі був написаний на РНР, якого я не те щоб не вчив, я навіть не розумів, що то за код такий цікавий. Код віддалено мені нагадав Java Script і я почав, чисто інтуїтивно та за допомогою всемогучого інтернету, щось змінювати під себе та для зручності.</P>

                <P>Тож, закінчивши з налаштуванням панелі, я зрозумів, що нею зможе скористатись кожен, хто буде знати шлях до її дерикторії, тобто слід було зробити вхід через введення логіну і паролю.</P>

                <P>Тоді я і познайомився з поняттям бази даних і більш плідно попрацював з РНР</P>
            </Wrapper>
        </>
    )
};

export default Periodpress;