{
  "header": {
    "link":{
      "home": "Головна",
      "about": "Про мене",
      "contacts": "Контакти"
    }
  },

  "modal-form": {
    "button": "Написати мені",
    "name": "Введіть своє ім'я",
    "textarea": "Введіть мету Вашого звернення та контактні данні за якими я зможу з Вами зв'язатись",
    "submit": "Відправити",
    "send": "Лист відправлено, чекайте на відповідь!"
  },
  
  "home": {
    "title": {
      "page": "Головна",
      "head": "Portfolio"
    },

    "meta": {
      "description": "Сайт-візитка front-end розробника Yevhen Doroshenko",
      "keywords": "Yevhen Doroshenko, , front-end, розробка програмного забезпечення"
    },

    "wellcome-text": "Ласкаво прошу на мій сайт",

    "article": {
      "period-title": "сайт periodpress.onu.edu.ua",
      "dveri-title": "сайт dveri-service.com.ua",
      "mebel-title": "сайт mebel-24.com.ua",
      "test-ds-title": "тестове завдання для Digital Solution",
      "selector": "Дізнатись більше"
    }
  },

  "about": {
    "title": {
      "page": "Про мене",
      "head": "ПРО МЕНЕ:",
      "head2": "ОСВІТА:"
    },

    "meta": {
      "description": "Сайт-візитка front-end розробника Yevhen Doroshenko",
      "keywords": "Yevhen Doroshenko, , front-end, розробка програмного забезпечення, сайт"
    },
    
    "content": {
      "p1": "Я цілеспрямована, ініціативна та надійна людина. Завжди готовий дізнаватися щось нове і постійно йти до своєї мети. я готовий наполегливо працювати, щоб покращити свої навички. Особисті якості: швидко навчаюсь, комунікабельний, люблю працювати в команді.",
      "p2": "2018 - ATO-IT - сертифікат Про успішне проходження курсу “Введення в розробку веб сайтів та мобільних додатків” - Рекомендована позиція - trainee front-end developer.",
      "p3": "2020 - Lviv IT School через платформу масових відкритих онлайн-курсів Prometheus - сертифікат про успішне проходження курсу 'Основи Web UI розробки 2020'.",
      "p4": "2021 - по теперішній час - проходжу курс на платформі 'Udemy' 'React+Redux - професійна розробка', по закінченню, додам сертифікат в галерею",
      "p5": "Tакож я навчаюся в IT-BRO Academy на курсі React/Redux, і цей сайт повністю побудований на ReactJS",
      "p6": "В галереї ви можете ознайомитись з сертифікатами про проходження навчання:"
    }
  },

  "contacts": {
    "title": {
      "page": "Контакти",
      "head": "ЯК ЗІ МНОЮ ЗВ'ЯЗАТИСЬ:"
    },

    "meta": {
      "description": "Сайт-візитка front-end розробника Yevhen Doroshenko",
      "keywords": "Yevhen Doroshenko, , front-end, розробка програмного забезпечення, сайт"
    },
    
    "content": {
      "p1": "Тел: +38(096)-021-30-30",
      "p2": "Мейл: evgen_doroshenko25@ukr.net",
      "p3": "Завантажити резюме:"
    }
  },

  "periodpress": {
    "title": {
      "page": "Сайт для кафедри періодичної преси",
      "head": "БІЛЬШ ДЕТАЛЬНО ПРО РОБОТУ НАД САЙТОМ 'PERIODPRESS.ONU.EDU.UA'"
    },

    "meta": {
      "description": "Сайт-візитка front-end розробника Yevhen Doroshenko, periodpress.onu.edu.ua",
      "keywords": "Yevhen Doroshenko, , front-end, розробка програмного забезпечення, сайт, periodpress.onu.edu.ua"
    },
    
    "content": {
      "p1": "В далекому вже, 2018, коли курс ATO-IT підходив до своєї завершальної стадії, кожному з учасників було надане завдання з створення першого сайту. Кожен з нас повинен був знайти клієнта, якому потрібен простий сайт, або, була можливість, написати сайт просто для себе. Я, в свою чергу, вирішив не шукати легких шляхів і взявся за втілення в життя, на той момент, для мене, дуже складного проєкту, на достатньо велику кількість сторінок.",
      "p2": "Насправді, сайт дуже простий, в ньому немає ні зворотнього зв'язку, ні складного JS скріпту. Його дизайн родом з початку 2000-х. Проте, як першим моїм проєктом, я дуже був ним задоволений.",
      "p3": "В один прекрасний день я зрозумів, що сайту потрібен апгрейд, бо кожен раз лазити в код, щоб змінити будь-який текст, було тією ще морокою. Тому, вмотивувашись на результат і знайшовши розробку адміністративної панелі, я вирішив створити щось, що хоч віддалено нагадувало б адміністративну панель та вирішувало б елементарні питання, будь то зміна тексту або картинки.",
      "p4": "Зразок, знайденої мною адмін панелі був написаний на РНР, якого я не те щоб не вчив, я навіть не розумів, що то за код такий цікавий. Код віддалено мені нагадав Java Script і я почав, чисто інтуїтивно та за допомогою всемогучого інтернету, щось змінювати під себе та для зручності.",
      "p5": "Тож, закінчивши з налаштуванням панелі, я зрозумів, що нею зможе скористатись кожен, хто буде знати шлях до її дерикторії, тобто слід було зробити вхід через введення логіну і паролю.",
      "p6": "Тоді я і познайомився з поняттям бази даних і більш плідно попрацював з РНР."
    }
  },

  "dveri": {
    "title": {
      "page": "Сайт для компанії 'Двері-Сервіс'",
      "head": "БІЛЬШ ГРУНТОВНО ЩОДО ПРОЦЕСУ СТВОРЕННЯ САЙТУ ДЛЯ КОМПАНІЇ 'ДВЕРІ-СЕРВІС'"
    },

    "meta": {
      "description": "Сайт-візитка front-end розробника Yevhen Doroshenko, dveri-service.com.ua",
      "keywords": "Yevhen Doroshenko, , front-end, розробка програмного забезпечення, сайт, dveri-service.com.ua"
    },
    
    "content": {
      "p1": "Одного прекрасного весняного вечора мені написала знайома з курсів АТО-ІТ, який ми разом проходили, та запропонувала допомогти їй в налагодженні сайту вище вказанної компанії.",
      "p2": "Стару версію сайту було створено на 'Joomla!'. Сам сайт обслуговувався різними людьми у різний період, щодо оптимізації під мобільні девайси мови взагалі не йшло. Тому нами було прийнято рішення, за дуже скромну плату, створити новий сайт, зі схожим дизайном, але на 'Wordpress'. Так вирішили, тому що вчергове переробляти старий сайт після когось було не рентабельно.",
      "p3": "В процесі розробки нового дизайну сайту, я вивчав особливості CMS 'Wordpress'. Коли стало зрозуміло, що роботу мені доведеться робити одному, оскільки у колеги не вистачало часу на цей проєкт, я звернув увагу на 'Elementor' для 'Wordpress'. Тож в результаті, сайт практично повністю був створений за допомогою  'Elementor'.",
      "p4": "Основна посилкова структура сайту була збережена, що дало змогу, не так сильно просісти в пошуковій видачі(на перший час). На даний час я здійснюю адміністрування цього ресурсу. Час від часу додаю сторінки, відео-, фотороботи. З 'Elementor' це робити достатньо просто і не займає багато часу."
    }
  },

  "mebel": {
    "title": {
      "page": "Адміністрування сайту 'Mebel-24'",
      "head": "ПРО САЙТ КОМПАНІЇ 'МЕБЛІ-24'"
    },

    "meta": {
      "description": "Сайт-візитка front-end розробника Yevhen Doroshenko, mebel-24.com.ua",
      "keywords": "Yevhen Doroshenko, , front-end, розробка програмного забезпечення, сайт, mebel-24.com.ua"
    },
    
    "content": {
      "p1": "Не так давно зі мною зв'язався власник сайту 'Меблі-24'. Він написав мені, що в нього є суттєві проблеми з організацією сайту та деякі проблеми в адмініструванні і SEO, а також вказавши, що сайт розроблений в 'Opencart'. Не довго роздумуючи я дав згоду на допомогу, проте попередив, що з 'Opencart' я ніколи не працював, тому можливо робота буде просуватись не швидко. Також SEO оптимізацією я ніколи не займався, так як вона мені не дуже імпонує;)",
      "p2": "Тож, визначившись з об'ємом роботи я заглибився у вивчення особливостей CMS 'Opencart'. Тут я зрозумів, що система в принципі зрозуміла, проте блоки керування розкидані по всій адміністративній панелі і щоб знайти параметри редагування якогось маленького тексту, часом я витрачав по декілька годин. Також в 'Opencart' є такі параметри, редагування котрих не передбачене стандартною панеллю керування.",
      "p3": "На скільки я зрозумів, за цей, поки що не довгий період роботи з вказаним сайтом, код контенту сторінки 'Opencart' формує з компонентів, а інформацію в компоненти бере з папок 'Cache' на різних рівнях. Дуже погано зрозуміла будова сторінки для подальшого її розбору та редагування. Проте, якщо порівнювати з системою плагінів 'Wordpress', тут також присутні модулі, є як безкоштовні так і платні.",
      "p4": "За період роботи з сайтом 'Меблі-24', мною проведено аналіз роботи та працездатності сайту, видалено деякий код з шаблону, який заважав коректно відображатись контенту та посилковій масі підвалу. Додано модуль організації товару за кількістю на складі менше 1-го. Виправлено порядок відображення контенту на різних мовах, таких як тексту та картинок. Також зробив можливим додавати 'description' на системні сторінки, в яких цього параметру з коробки немає та інше.",
      "p5": "Також, хочу зазначити, що мої знання в РНР не глибокі, я його не вчив від А до Я. Знаю тільки деякі параметри і функції, проте це не заважає мені розбиратись і розуміти код РНР залежних сайтів;)"
    }
  },

  "paginator": {
    "prev": "Попередня",
    "next": "Наступна"
  },

  "cookies": {
    "text": "Мій сайт використовує файли cookie для зберігання даних. Продовжуючи використання сайту, Ви даєте згоду на роботу з цими файлами.",
    "button": "Зрозуміло"
  },

  "test-ds": {
    "title": {
      "page": "Тестове завдання для 'Digital Solution'",
      "head": "Про тестове завдання для 'Digital Solution'"
    },

    "meta": {
      "description": "Сайт-візитка front-end розробника Yevhen Doroshenko, mebel-24.com.ua",
      "keywords": "Yevhen Doroshenko, , front-end, розробка програмного забезпечення, сайт, mebel-24.com.ua"
    },
    
    "content": {
      "p1": "З 'LinkedIn' мені прийшло повідомлення від HR Manager в 'Digital Solution'. яка запропонувала мені пройти технічний тест на позицію Junior+, Middle Front-end developer, на що я зголосився.",
      "p2": "Суть завдання заключалась в тому, що треба було зверстати сторінку на ReactJS з використанням Bootstrap. Після чого слід було залити зміни на GitHub та написати інструкцію з встановлення сайту.",
      "p3": "Посилання на макет - ",
      "p4": "Подивившись на макет, я вирішив не псувати його бутстрапом і в результаті всі стилі написав вручну.",
      "p5": "У підсумку для стилізації я використав 'styled-components' для відображення title 'react-helmet', для корректної роботи інпуту введення номеру телефону застосував 'react-phone-number-input'.",
      "p6": "Насправді, макет виявився досить складним в реалізації і там є ще пару фішок, над якими довелося попотіти, але це досить корисний досвід, а також нова робота в моєму портфоліо.",
      "p7": "Посилання на готову роботу - "
    }
  }

}